Revit API Introduction Labs
Lab6_1_HelloWorldExternalApplication.OnShutdown Method
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public Result OnShutdown(
	UIControlledApplication a
)
Visual Basic (Declaration)
Public Function OnShutdown ( _
	a As UIControlledApplication _
) As Result
Visual C++
public:
virtual Result OnShutdown(
	UIControlledApplication^ a
) sealed
Parameters
a
Type: UIControlledApplication
Implements
IExternalApplicationOnShutdown(UIControlledApplication)
See Also
Lab6_1_HelloWorldExternalApplication Class
Labs Namespace